{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# Задание 1"
      ],
      "metadata": {
        "id": "xObofRLg73tB"
      }
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "RXzCgKa9tlMj"
      },
      "source": [
        "Напишите программу по оценке экзаменационных результатов пользователей на основе введенных баллов (максимум 100 баллов).\n",
        "\n",
        "1. Если пользователь набрал 90 баллов и выше - получает оценку \"Отлично\".\n",
        "2. Оценка \"Хорошо\" начинается от 70 баллов (включительно).\n",
        "3. Оценка \"Удовлетворительно\" от 50 баллов (включительно).\n",
        "4. Если оценка ниже - то экзамен считается проваленным, предложите пользователю прийти на пересдачу."
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "ujDD4mGcihXq",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "8489cfbb-b3ee-468e-ff6b-e183e5ed0ffc"
      },
      "source": [
        "bali = int(input('Чтобы узнать оценку экзаменационных результатов введите колличество полученных балов:\\n', ))\n",
        "if bali >= 90:\n",
        "  print('Ваша оценка: Отлично!')\n",
        "elif bali >= 70:\n",
        "  print('Ваша оценка: Хорошо!')\n",
        "elif bali >= 50:\n",
        "  print('Ваша оценка: Удовлетворительно!')\n",
        "else:\n",
        "  print('К сожалению вы не сдали экзамен: Приходите на перездачу!')"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Чтобы узнать оценку экзаменационных результатов введите колличество полученных балов:\n",
            "38\n",
            "К сожалению вы не сдали экзамен: Приходите на перездачу!\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "# Задание 2"
      ],
      "metadata": {
        "id": "p9SDAb2F77_p"
      }
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "-8XkwcmIlTur"
      },
      "source": [
        "Машины по очереди заезжают на парковку, пока в ней есть свободные места. Вместимость парковки 8 авто.\n",
        "\n",
        "Используя цикл `while`, каждый заезд очередной машины сопроводите сообщением `\"Машина заехала\"`. Выведите на экран количество свободных мест на парковке после заезда очередной машины.\n",
        "\n",
        "Когда парковка окажется полной - сообщите остальным автовладельцам, что места в ней больше нет"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "TEnwkFpMCZTI",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "82078058-5df0-43ba-a577-4aa2a0ad36cd"
      },
      "source": [
        "mst = 0\n",
        "while mst <= 8:\n",
        "  if mst < 8:\n",
        "    print(f'количество свободных мест на парковке: {8 - mst}')\n",
        "  else:\n",
        "    print('К сожалению свободные места на парковке закончились')\n",
        "  mst +=1"
      ],
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "количество свободных мест на парковке: 8\n",
            "количество свободных мест на парковке: 7\n",
            "количество свободных мест на парковке: 6\n",
            "количество свободных мест на парковке: 5\n",
            "количество свободных мест на парковке: 4\n",
            "количество свободных мест на парковке: 3\n",
            "количество свободных мест на парковке: 2\n",
            "количество свободных мест на парковке: 1\n",
            "К сожалению свободные места на парковке закончились\n"
          ]
        }
      ]
    }
  ]
}